AugensternCode/Drone_Remote_stm32/Drone/OBJ/oled.h
#ifndef _oled_h_
#define _oled_h_

#include "stm32f10x.h"

/*
 * OLED ?????
 *
 * ???? I2C ???????? OLED?
 * ?????????????????????
 */

#define OLED_MODE   0
#define SIZE        8
#define XLevelL     0x00
#define XLevelH     0x10
#define Max_Column  128
#define Max_Row     64
#define Brightness  0xFF
#define X_WIDTH     128
#define Y_WIDTH     64

#define OLED_CMD    0
#define OLED_DATA   1

void OLED_Init(void);
void OLED_WR_Byte(unsigned Data, unsigned DataType);
void Write_OLED_Command(unsigned char IIC_Command);
void Write_OLED_Data(unsigned char IIC_Data);
void fill_picture(unsigned char fill_Data);
void OLED_Set_Pos(unsigned char x, unsigned char y);
void OLED_Display_On(void);
void OLED_Display_Off(void);
void OLED_Clear(void);
void OLED_On(void);
u32 oled_pow(u8 m, u8 n);
void OLED_ShowChar(u8 x, u8 y, u8 chr, u8 Char_Size);
void OLED_ShowNum(u8 x, u8 y, u32 num, u8 len, u8 size2);
void OLED_ShowString(u8 x, u8 y, u8 chr[], u8 Char_Size);
void OLED_ShowCHinese(u8 x, u8 y, u8 no);
void OLED_DrawBMP(unsigned char x0, unsigned char y0, unsigned char x1, unsigned char y1, unsigned char BMP[]);
void Oled_Char_Display(u8 raw, u8 column, u8 str[]);

#endif
